app/Controllers/AdminController.php

    public function dashboard()
    {
        $salesStats = $this->orderModel->getSalesStats();

        $data = [
            'title' => 'Admin Dashboard',
            'total_products' => $this->productModel->countAll(),
            'total_categories' => $this->categoryModel->countAll(),
            'total_users' => model(UserModel::class)->countAll(),
            'total_orders' => $this->orderModel->countAll(),
            'recent_products' => $this->productModel->orderBy('created_at', 'DESC')->limit(5)->find(),
---
SELECT COUNT(*) AS `numrows` FROM `products`
SELECT COUNT(*) AS `numrows` FROM `categories`
SELECT COUNT(*) AS `numrows` FROM `users`
SELECT COUNT(*) AS `numrows` FROM `orders`
SELECT *
FROM `products`
ORDER BY `created_at` DESC
 LIMIT 5