app/Controllers/ApiShipping.php

SELECT *
FROM `user_addresses`
WHERE `user_id` = '3'
AND `is_default` = 1
---
    public function getCost()
    {
        $request = service('request');
        $session = service('session');
        $db = db_connect();

        // Pastikan user login
        if (!$session->get('isLoggedIn')) {
            return service('response')->setStatusCode(403)->setJSON(['error' => 'Access denied']);
        }

        // Ambil data user dan kurir
        $user = $session->get('user');
        $userId = $user['id'] ?? null;
        $courier = $request->getPost('courier');

        if (empty($courier)) {
            return service('response')->setJSON(['error' => 'Kurir wajib diisi.']);
        }

        // Ambil alamat utama user
        $address = $db->table('user_addresses')
            ->where('user_id', $userId)
            ->where('is_default', 1)
            ->get()
            ->getRow();

SELECT `nama`
FROM `wilayah`
WHERE `kode` = '21.04'
---
        }

        // Ambil nama kota untuk tampilan
        $city = $db->table('wilayah')->select('nama')->where('kode', $cityKode)->get()->getRow();

SELECT `weight`
FROM `products`
WHERE `id` = '5'
---

        $totalWeight = 0;
        foreach ($cartItems as $item) {
            $productWeight = $db->table('products')->select('weight')->where('id', $item['product_id'])->get()->getRow('weight') ?? 100;