app/Controllers/AuthController.php

SELECT *
FROM `users`
WHERE `email` = 'budi@bud.com'
 LIMIT 1
---
        public function processLogin()
    {
        $session = session();
        $userModel = new UserModel();
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $user = $userModel->where('email', $email)->first();