app/Controllers/Checkout.php

SELECT `user_addresses`.*, `prov`.`nama` AS `province_name`, `city`.`nama` AS `city_name`, `sub`.`nama` AS `subdistrict_name`
FROM `user_addresses`
LEFT JOIN `wilayah` AS `prov` ON `prov`.`kode` = `user_addresses`.`province_kode`
LEFT JOIN `wilayah` AS `city` ON `city`.`kode` = `user_addresses`.`city_kode`
LEFT JOIN `wilayah` AS `sub` ON `sub`.`kode` = `user_addresses`.`subdistrict_kode`
WHERE `user_addresses`.`user_id` = '3'
ORDER BY `user_addresses`.`is_default` DESC
---
    public function index()
    {
        $userData = $this->session->get('user');
        if (!$userData || !isset($userData['id'])) {
            return redirect()->to('/login')->with('error', 'Silakan login terlebih dahulu.');
        }
        $userId = $userData['id'];

        $db = db_connect();
        $addresses = $db->table('user_addresses')
            ->select('user_addresses.*, prov.nama AS province_name, city.nama AS city_name, sub.nama AS subdistrict_name')
            ->join('wilayah AS prov', 'prov.kode = user_addresses.province_kode', 'left')
            ->join('wilayah AS city', 'city.kode = user_addresses.city_kode', 'left')
            ->join('wilayah AS sub', 'sub.kode = user_addresses.subdistrict_kode', 'left')
            ->where('user_addresses.user_id', $userId)
            ->orderBy('user_addresses.is_default', 'DESC')
            ->get()
            ->getResultArray();

SELECT `image_url`
FROM `products`
WHERE `products`.`id` = '5'
---
        $total = 0;

        foreach ($cartItems as $item) {
            $product = $this->productModel->select('image_url')->find($item['product_id']);

SELECT *
FROM `users`
WHERE `users`.`id` = '3'
---
            'cartItems' => $itemsForView,
            'total' => $total,
            'addresses' => $addresses,
            'user' => $this->userModel->find($userId),

SELECT *
FROM `user_addresses`
WHERE `id` = '5'
AND `user_id` = '3'
 LIMIT 1
---
    public function placeOrder()
    {
        $postData = $this->request->getPost();
        $userData = $this->session->get('user');

        if (!$userData || !isset($userData['id'])) {
            return redirect()->to('/login')->with('error', 'Sesi Anda telah berakhir, silakan login lagi.');
        }
        $userId = $userData['id'];

        $cartItems = $this->cartModel->getCartItems($userId);
        if (empty($cartItems)) {
            return redirect()->to('/cart')->with('error', 'Keranjang kamu kosong.');
        }

        $address = $this->userAddressModel->where([
            'id' => $postData['user_address_id'] ?? 0,
            'user_id' => $userId
        ])->first();

INSERT INTO `orders` (`order_id`, `user_id`, `status_pembayaran`, `status_pesanan`, `subtotal`, `shipping_cost`, `discount_amount`, `kode_unik`, `total_bayar`, `payment_method`, `shipping_service`, `shipping_address`, `created_at`, `updated_at`) VALUES ('INV-20251110-5PKZ4N', '3', 'pending', 'baru', 1149000, 0, 50000, 119, 1099119, 'bca_manual', 'Unknown', 'asd (12412421412414)\nJenderal Achmad Yani University, Kecamatan Cimahi Selatan, Indonesia\nundefined, undefined\nundefined, 43196', '2025-11-10 13:01:17', '2025-11-10 13:01:17')
---
            $orderItemModel = new OrderItemModel();

            // Simpan order utama
            $orderModel->insert($orderData);

INSERT INTO `order_items` (`order_id`, `price`, `product_id`, `product_name`, `quantity`)
VALUES (6,'299000.00','5','Jeans Pria Slim-Fit Washed Blue','3'), (6,'12000.00','11','Nikro','21')
---
                ];
            }

            $orderItemModel->insertBatch($itemsToSave);