app/Controllers/landing.php

SELECT *
FROM `products`
ORDER BY `created_at` DESC
 LIMIT 8
---
    public function index()
    {
        $productModel = new ProductModel();
        $data = [
            'title'    => 'UncleStore | Jual Beli Online',
            // Ambil 8 produk terbaru saja
            'products' => $productModel->orderBy('created_at', 'DESC')->findAll(8),
        ];

SELECT *
FROM `categories`
SELECT *
FROM `products`
---
    public function products()
    {
        $productModel = new ProductModel();
        $categoryModel = new CategoryModel();

        $categories = $categoryModel->findAll();
        $products = $productModel->findAll();