app/Controllers/ProductController.php

SELECT *
FROM `products`
WHERE `slug` = 'polo-shirt-kerah-strip'
 LIMIT 1
---
    public function detail($slug)
    {
        $productModel = new ProductModel();
        $product = $productModel->where('slug', $slug)->first();

INSERT INTO `cart_items` (`user_id`, `product_id`, `quantity`, `created_at`, `updated_at`) VALUES ('2', '3', 1, '2025-11-02 12:51:43', '2025-11-02 12:51:43')
---
    public function addToCart()
    {
        // Cek dulu apakah user sudah login
        if (!$this->session->get('isLoggedIn')) {
            return redirect()->to('login')->with('error', 'Silakan login untuk menambahkan produk ke keranjang.');
        }

        $userId = $this->session->get('user')['id'];
        $productId = $this->request->getPost('product_id');
        $quantity = 1;

        // Cek apakah produk sudah ada di keranjang user ini
        $existingItem = $this->cartModel->where(['user_id' => $userId, 'product_id' => $productId])->first();

        if ($existingItem) {
            // Jika sudah ada, update quantity-nya
            $newQuantity = $existingItem['quantity'] + $quantity;
            $this->cartModel->update($existingItem['id'], ['quantity' => $newQuantity]);
        } else {
            // Jika belum ada, insert data baru
            $this->cartModel->insert([
                'user_id'    => $userId,
                'product_id' => $productId,
                'quantity'   => $quantity,
            ]);