app/Controllers/UserController.php

    public function profile()
    {
        if (!$this->session->get('isLoggedIn')) {
            return redirect()->to('login');
        }

        $userId = $this->session->get('user')['id'];
        $user = $this->userModel->find($userId);
        $addresses = $this->addressModel->where('user_id', $userId)->findAll();
---
SELECT *
FROM `users`
WHERE `users`.`id` = '3'
SELECT *
FROM `user_addresses`
WHERE `user_id` = '3'

    public function updateProfile()
    {
        if (!$this->session->get('isLoggedIn')) {
            return redirect()->to('login');
        }

        $userId = $this->session->get('user')['id'];

        $rules = [
            'name' => 'required|min_length[3]|max_length[100]',
            'email' => 'required|valid_email|is_unique[users.email,id,' . $userId . ']',
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $data = [
            'name' => $this->request->getPost('name'),
            'email' => $this->request->getPost('email'),
        ];

        // Update password if provided
        if ($this->request->getPost('password')) {
            $data['password_hash'] = password_hash($this->request->getPost('password'), PASSWORD_DEFAULT);
        }

        $this->userModel->update($userId, $data);

        // Update session data
        $updatedUser = $this->userModel->find($userId);
---
UPDATE `users` SET `name` = 'Nikros', `email` = 'nikro@gmail.com', `updated_at` = '2025-11-10 13:04:00'
WHERE `users`.`id` IN ('3')
SELECT *
FROM `users`
WHERE `users`.`id` = '3'