app/Models/CartModel.php

    public function getCartItems($userId)
    {
        return $this->select('cart_items.id as cart_item_id, cart_items.quantity, products.id as product_id, products.name, products.price, products.image_url, products.stock')
                    ->join('products', 'products.id = cart_items.product_id')
                    ->where('cart_items.user_id', $userId)
                    ->orderBy('cart_items.created_at', 'DESC')
                    ->findAll();
---
SELECT `cart_items`.`id` as `cart_item_id`, `cart_items`.`quantity`, `products`.`id` as `product_id`, `products`.`name`, `products`.`price`, `products`.`image_url`, `products`.`stock`
FROM `cart_items`
JOIN `products` ON `products`.`id` = `cart_items`.`product_id`
WHERE `cart_items`.`user_id` = '2'
ORDER BY `cart_items`.`created_at` DESC