app/Models/OrderModel.php

    public function getOrdersWithDetails($limit = null)
    {
        $builder = $this->db->table('orders');
        $builder->select('orders.*, users.name as user_name, promos.name as promo_name');
        $builder->join('users', 'users.id = orders.user_id', 'left');
        $builder->join('promos', 'promos.id = orders.promo_id', 'left');
        $builder->orderBy('orders.created_at', 'DESC');

        if ($limit) {
            $builder->limit($limit);
        }

        return $builder->get()->getResult();
---
SELECT `orders`.*, `users`.`name` as `user_name`, `promos`.`name` as `promo_name`
FROM `orders`
LEFT JOIN `users` ON `users`.`id` = `orders`.`user_id`
LEFT JOIN `promos` ON `promos`.`id` = `orders`.`promo_id`
ORDER BY `orders`.`created_at` DESC
 LIMIT 5

    public function getSalesStats($period = 'monthly')
    {
        $builder = $this->db->table('orders');
        $builder->select("
            DATE_FORMAT(created_at, '%Y-%m') as period,
            COUNT(*) as total_orders,
            SUM(final_amount) as total_revenue,
            AVG(final_amount) as avg_order_value
        ");
        $builder->where('status', 'delivered');
        $builder->groupBy("DATE_FORMAT(created_at, '%Y-%m')");
        $builder->orderBy('period', 'DESC');
        $builder->limit(12);

        return $builder->get()->getResult();
---
SELECT DATE_FORMAT(created_at, '%Y-%m') as period, COUNT(*) as total_orders, SUM(final_amount) as total_revenue, AVG(final_amount) as avg_order_value
FROM `orders`
WHERE `status` = 'delivered'
GROUP BY DATE_FORMAT(created_at, '%Y-%m')
ORDER BY `period` DESC
 LIMIT 12