app/Models/PromoModel.php

    public function checkPromo($code, $subtotal)
    {
        $promo = $this->where('code', $code)->first();
---
SELECT *
FROM `promos`
WHERE `code` = 'WELCOME10'
 LIMIT 1