app/Views/main_layout.php

                    <h3 class="font-bold mb-4">Products</h3>
                    <?php
                    $categoryModel = new \App\Models\CategoryModel();
                    $categories = $categoryModel->findAll();
---
SELECT *
FROM `categories`